import random
red=(1,3,5,7,9,12,14,16,18,19,21,23,25,27,30,32,34,36)
nomber=int(random.choice([0,00,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38]))
print('выпавший номер: '+str(nomber))
print('выигравшая ставка: '+str(nomber))
if (nomber!=0) or (nomber!=00):
    n=red.find(nomber)+1
    if nomber==red[n]:
        print('выигравшая ставка: красное')
        if nomber%2:
            print('выигравшая ставка: нечетное')
        else:
            print('выигравшая ставка: четное')
    else:
        print('выигравшая ставка: черное')
        if nomber % 2:
            print('выигравшая ставка: нечетное')
        else:
            print('выигравшая ставка: четное')
