a = input('Введите буквенную оценку: - ')
if a == 'A+':
    print('Ваша оценка: - 4.0')
elif a == 'A':
    print('Ваша оценка: - 4.0')
elif a == 'A-':
    print('Ваша оценка: - 3.7')
elif a == 'B+':
    print('Ваша оценка: - 3.3')
elif a == 'B':
    print('Ваша оценка: - 3.0')
elif a == 'B-':
    print('Ваша оценка: - 2.7')
elif a == 'C+':
    print('Ваша оценка: - 2.3')
elif a == 'C':
    print('Ваша оценка: - 2.0')
elif a == 'C-':
    print('Ваша оценка: - 1.7')
elif a == 'D+':
    print('Ваша оценка: - 1.3')
elif a == 'D':
    print('Ваша оценка: - 1.0')
elif a == 'F':
    print('Ваша оценка: - 0')
else:
    print('Введена неверная оценка :(')

